In [17]:
# 
with open(r'C:\Users\gupta\OneDrive\Desktop\data.txt\data.txt' , 'r') as f:
    txt = f.read()
txt

word = {}
for i in txt:
    if i in word:
        word[i]+=1
    else:
        word[i]=1

print(word)

{'H': 1, 'i': 2, ' ': 3, 'a': 3, 'm': 1, 'p': 1, 'l': 1, 'k': 1}

In [29]:
# 2. even numbers, sorted ascending order
lst = [1,4,5,7,8,6,4,2,3,5,6]
my_lst = sorted([x for x in lst if x % 2 == 0])

print(my_lst)

[2, 4, 4, 6, 6, 8]

In [11]:
# 3. Find the highest score
import pandas as pd

students = {
    "Name" : ['Alice', 'Bob', 'Charlie', 'David'],
    "Score" : [85, 92, 78, 90]
}

df = pd.DataFrame(students)
df.sort_values(by = 'Score')
df.iloc[-1]
df

      Name  Score
0    Alice     85
1      Bob     92
2  Charlie     78
3    David     90

In [13]:
# average score
averages = df["Score"].mean()
print(averages)

86.25

In [3]:
#Part-B 4. Load the data set 
import pandas as pd
data = {"Name": ["Alice","Bob","Charlie","David","Eva"],
        "Age": [20,21,19,22,20],
        "Gender": ["F","M","M","M","F"],
        "Math": [85,78,92,76,89],
        "Science": [88,82,92,80,94],
        "English": [90,85,87,79,92]}
df = pd.DataFrame(data)
df.to_csv('student.csv' , index = False)
df

      Name  Age Gender  Math  Science  English
0    Alice   20      F    85       88       90
1      Bob   21      M    78       82       85
2  Charlie   19      M    92       92       87
3    David   22      M    76       80       79
4      Eva   20      F    89       94       92

In [2]:
# 5. Display the first 5 row
df.head()

      Name  Age Gender  Math  Science  English
0    Alice   20      F    85       88       90
1      Bob   21      M    78       82       85
2  Charlie   19      M    92       92       87
3    David   22      M    76       80       79
4      Eva   20      F    89       94       92

In [4]:
# Basic info about data set 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Gender   5 non-null      object
 3   Math     5 non-null      int64
 4   Science  5 non-null      int64
 5   English  5 non-null      int64
dtypes: int64(4), object(2)
memory usage: 372.0+ bytes

In [4]:
# 6. Find the average marks
averages = df[["Math","Science","English"]].mean()
print(averages)

Math       84.0
Science    87.2
English    86.6
dtype: float64

In [13]:
# 7. Sum of all subject
df["Total"] = df["Math"] + df["Science"] + df["English"]
print(df)

      Name  Age Gender  Math  Science  English  Total
0    Alice   20      F    85       88       90    263
1      Bob   21      M    78       82       85    245
2  Charlie   19      M    92       92       87    271
3    David   22      M    76       80       79    235
4      Eva   20      F    89       94       92    275

In [14]:
#8. Add another column "Grade" with the rule
def grade(Total):
    if Total >= 250:
        return 'A'
    elif 200 <= Total < 250:
        return 'B'
    else:
        return 'C'
df["Grade"] = df["Total"].apply(grade)
df

      Name  Age Gender  Math  Science  English  Total Grade
0    Alice   20      F    85       88       90    263     A
1      Bob   21      M    78       82       85    245     B
2  Charlie   19      M    92       92       87    271     A
3    David   22      M    76       80       79    235     B
4      Eva   20      F    89       94       92    275     A

In [15]:
# 9. Find the top 3 students based on "Total"
top3 = df.sort_values(by="Total",ascending=False).head(3)
print(top3)

      Name  Age Gender  Math  Science  English  Total Grade
4      Eva   20      F    89       94       92    275     A
2  Charlie   19      M    92       92       87    271     A
0    Alice   20      F    85       88       90    263     A

In [16]:
# 10. Calculate the average "Math" score for each group
avg_math_by_gender = df.groupby("Gender")["Math"].mean()
print(avg_math_by_gender)

Gender
F    87.0
M    82.0
Name: Math, dtype: float64

In [17]:
# Bonus Challenge 11. CSV file called student_result.csv
df.to_csv("students_result.csv",index=False)
print("Data exported successfully to 'students_result.csv'")

Data exported successfully to 'students_result.csv'